#include <iostream>

using namespace std;

int main() {
	// 분기 구문을 위해 if와 switch를 사용할 수 있다.

	if (true) { cout << "조건이 참이다1." << endl; }
	if (true) cout << "조건이 참이다2." << endl; // 실행이 한 줄일 때 {중괄호} 생략 가능
	if (false) cout << "조건이 거짓이다." << endl;
// ========================================================================================================
	if (true) {
		cout << "조건이";
		cout << " 참입니다." << endl;
	} else {
		cout << "조건이";
		cout << " 거짓입니다." << endl;
	}
// ========================================================================================================
	if (false) {
		cout << "#1" << endl;
	}
	else if(true) {
		cout << "#2" << endl;
	}
	else {
		cout << "#3" << endl;
	}
// ========================================================================================================
	int a = 0;

	if (a == 0) {
		cout << 1 << endl;
	} else {
		cout << 2 << endl;
	}

	cout << "프로그램이 종료되었습니다.";

	return 0;
}